<?php

return [
    'login_success' => 'تم تسجيل الدخول بنجاح',
    'name.required' => 'اسم المستخدم مطلوب.',
    'name.string' => 'اسم المستخدم يجب أن يكون نصًا.',
    'name.max' => 'اسم المستخدم لا يمكن أن يتجاوز 255 حرفًا.',
    'email.required' => 'البريد الإلكتروني مطلوب.',
    'email.email' => 'البريد الإلكتروني غير صحيح.',
    'email.unique' => 'البريد الإلكتروني مسجل بالفعل.',
    'phone.required' => 'رقم الهاتف مطلوب.',
    'phone.string' => 'رقم الهاتف يجب أن يكون نصًا.',
    'phone.unique' => 'رقم الهاتف مسجل بالفعل.',
    'password.required' => 'كلمة المرور مطلوبة.',
    'password.string' => 'كلمة المرور يجب أن تكون نصًا.',
    'password.min' => 'كلمة المرور يجب أن تكون على الأقل 6 أحرف.',
    'confirm_password.required' => 'تأكيد كلمة المرور مطلوب.',
    'confirm_password.string' => 'تأكيد كلمة المرور يجب أن يكون نصًا.',
    'confirm_password.same' => 'كلمة المرور وتأكيد كلمة المرور يجب أن يتطابقا ',

    // رسائل تسجيل الدخول
    'login.required' => 'البريد الإلكتروني أو رقم الهاتف مطلوب.',
    'login.string' => 'البريد الإلكتروني أو رقم الهاتف يجب أن يكون نصًا.',
    'password.required' => 'كلمة المرور مطلوبة.',
    'password.min' => 'كلمة المرور يجب أن تكون على الأقل 6 أحرف.',
    
    // رسائل أخرى
    'credentials_invalid' => 'بيانات الاعتماد غير صحيحة.',
    'validation_error' => 'حدثت أخطاء أثناء التحقق من البيانات.',
    'login_error' => 'حدث خطأ أثناء تسجيل الدخول. يرجى المحاولة مرة أخرى لاحقاً.',
    
    
     'email.exists' => 'البريد الإلكتروني غير موجود في النظام.',
    
    // رسائل إعادة تعيين كلمة المرور
    'code.required' => 'يجب إدخال كود التحقق.',
    'password.required' => 'يجب إدخال كلمة المرور الجديدة.',
    'password.confirmed' => 'كلمة المرور وتأكيد كلمة المرور غير متطابقتين.',
    
    // رسالة النجاح في إعادة تعيين كلمة المرور
    'password_reset_success' => 'تم إعادة تعيين كلمة المرور بنجاح.',

    'verification_code_sent' => 'تم إرسال رمز التحقق إلى بريدك الإلكتروني.',

];

